Repository: Selutario/telegram_videos_bot
Catalog: Videogram/locale/*/LC_MESSAGES/*.po
Languages: es_es

# error
source: There has been an error ⚠
es_es: Ha habido algún error ⚠

source: Video 🎥
es_es: Vídeo 🎥

source: Title ✏
es_es: Título ✏

source: Description 📝
es_es: Descripción 📝

source: Cancel ❌
es_es: Cancelar ❌

# need_video_or_id
source: I need you to send me the video or its ID again.
es_es: Necesito que me reenvíes el video o su ID.

# error_video_not_found
source: I could not find that video. It's possible that it is in your Telegram app cache, but not in my database anymore
es_es: No he podido encontrar ese vídeo. Es posible que esté cacheado en tu aplicación de Telegram, pero ya no exista en mi base de datos.

# error_video_length
source: This video exceeds the maximum length allowed ({0}/{1} seconds). Please, trim it down.
es_es: El video supera la duración máxima ({0}/{1} segundos). Por favor, recórtalo.

# error_video_type
source: This video format is {0}, which is invalid. Please try another format.
es_es: El formato de este video es {0}, el cual es inválido. Por favor, intentalo con otro formato.

# error_title_length
source: You have exceeded the maximum length ({0}/{1} characters). Please, send me a shorter title.
es_es: Has superado la longitud máxima ({0}/{1} caracteres). Por favor, envíame un título más corto.

# error_desc_length
source: You have exceeded the maximum length ({0}/{1} characters). Please, send me a shorter description.
es_es: Has superado la longitud máxima ({0}/{1} caracteres). Por favor, envíame una descripción más corta.

# error_keywords_length
source: You have exceeded the maximum length ({0}/{1} characters). Please, send me less keywors.
es_es: Has superado la longitud máxima ({0}/{1} caracteres). Por favor, envíame menos palabras clave.

# channel_info_caption
source: <b>ID:</b> <code>{0}</code> <b>User:</b> <code>{1}</code> <b>Description:</b> <code>{2}</code> <b>Keywords:</b> <code>{3}</code>
es_es: <b>ID:</b> <code>{0}</code> <b>Usuario:</b> <code>{1}</code> <b>Descripción:</b> <code>{2}</code> <b>Keywords:</b> <code>{3}</code>

# video_info
source: <b>ID:</b> <code>{0}</code> <b>Title:</b> <code>{1}</code> <b>Description:</b> <code>{2}</code> <b>Keywords:</b> <code>{3}</code>
es_es: <b>ID:</b> <code>{0}</code> <b>Título:</b> <code>{1}</code> <b>Descripción:</b> <code>{2}</code> <b>Keywords:</b> <code>{3}</code>

# start_command
source: Hey. Write @{0} followed by some text to search for a video. For example: @{0} hello
es_es: Ey. Escribe @{0} junto a un texto para buscar un video. P. ej: @{0} hola

# unknown_command
source: Don't invent, please...
es_es: No inventes, por favor...

# cancel_command
source: Cancelling... ❌
es_es: Cancelando... ❌

# delete_start
source: Send me again the video you want to delete (🎥) or its ID (🆔).
es_es: Reenvíame el video que quieres eliminar (🎥) o su ID (🆔).

# delete_disabled
source: Video deletion is disabled 🔒
es_es: El borrado de vídeos está desactivado 🔒

# delete_no_permissions
source: You do not have permission to delete this video 🚫
es_es: No tienes permiso para borrar este video 🚫

# delete_confirm
source: <b>Title:</b> {0} <b>Description:</b> {1} Are you sure you want to delete this video?
es_es: <b>Título:</b> {0} <b>Descripción:</b> {1} ¿Seguro que quieres borrar este video?

# delete_ok
source: Video deleted successfully 🎉
es_es: Vídeo borrado con éxito 🎉

# edit_start
source: Send me again the video you want to edit (🎥) or its ID (🆔).
es_es: Reenvíame el video que quieres editar (🎥) o su ID (🆔).

# edit_disabled
source: Video editing is disabled 🔒
es_es: La edición de videos está desactivada 🔒

# edit_no_permissions
source: You don't have permission to edit this video 🚫
es_es: No tienes permiso para editar este video 🚫

# edit_choose_option
source: What do you want to edit?
es_es: ¿Qué quieres cambiar?

# edit_send_title
source: Send me a title (max {0} characters).
es_es: Envíame un título (max {0} caracteres).

# edit_send_desc
source: Send me a description (max {0} characters).
es_es: Envíame una descripción (max {0} caracteres).

# edit_send_keywords
source: Send me the new keywords (max {0} characters).
es_es: Envíame las nuevas palabras clave (max {0} caracteres).

# edit_send_video
source: Send me a new video.
es_es: Envíame un nuevo vídeo.

# edit_title_ok
source: Title updated successfully! 🎉
es_es: ¡Título actualizado con éxito! 🎉

# edit_need_title
source: I need a title.
es_es: Necesito un título.

# edit_desc_ok
source: Description updated successfully! 🎉
es_es: ¡Descripción actualizada con éxito! 🎉

# edit_need_desc
source: I need a description.
es_es: Necesito una descripción.

# edit_keywords_ok
source: Keywords updated successfully! 🎉
es_es: ¡Palabras clave actualizadas con éxito! 🎉

# edit_need_keywords
source: I need keywords.
es_es: Necesito palabras clave.

# edit_video_ok
source: Video updated successfully! 🎉
es_es: ¡Vídeo actualizado con éxito! 🎉

# edit_need_video
source: I need a video.
es_es: Necesito un vídeo.

# upld_send_video
source: Send me a video 🎥.
es_es: Envíame un video 🎥.

# upload_disabled
source: Video upload is disabled 🔒
es_es: La subida de videos está desactivada 🔒

# upld_send_title
source: Now send me the title (max {0} characters).
es_es: Ahora envíame el título (max {0} caracteres).

# upld_send_desc
source: Now send me a transcription of what is said in the video (max {0} characters)
es_es: Ahora una transcripción de lo que se dice en el vídeo (max {0} caracteres)

# upld_same_video_form
source: This other video has a similar description to the one you want to upload. Is it the same one?
es_es: Este otro vídeo tiene una descripción bastante similar al que quieres subir. ¿Es el mismo?

# upld_diff_video
source: It's different: continue 👍
es_es: Es distinto: continuar 👍

# upld_same_video
source: It's the same: cancel 👎
es_es: Es el mismo: cancelar 👎

# upld_send_keywords
source: Finally, some keywords that don't appear in the transcription (max {0} characters). For example: belen esteban sleep tired
es_es: Por último, algunas palabras clave que no aparezcan en la transcripción (max {0} caracteres). P. ej: belen esteban sueño cansado cansada

# upld_video_ok
source: Video uploaded successfully! 🎉 (<b>ID:</b> <code>{0}</code>)
es_es: ¡Video subido con éxito! 🎉 (<b>ID:</b> <code>{0}</code>)
